ЖБИ_УТ11.РасширениеЖБИ/src/InformationRegisters/ЖБИ_СтатусАктивностиКлиента/ЖБИ_СтатусАктивностиКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖБИ_СтатусАктивностиКлиента</name>
  <comment>ЖБИ - Статус активности клиента</comment>
  <resources>
    <name>СтатусКонтрагента</name>
    <type>
      <types>EnumRef.ЖБИ_СтатусКонтрагента</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <comment>Автор</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Комментарий</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Партнер</name>
    <comment>Партнер</comment>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЖБИ_УТ11.РасширениеЖБИ/src/InformationRegisters/ЖБИ_СтатусАктивностиКлиента/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры) = Тип("ДанныеФормыСтруктура") Тогда
		Если Параметры.Свойство("Партнер")
			И ЗначениеЗаполнено(Параметры.Партнер) Тогда
			Запись.Партнер = Параметры.Партнер;
		КонецЕсли;
		Если Параметры.Свойство("СтатусКонтрагента")
			И ЗначениеЗаполнено(Параметры.СтатусКонтрагента) Тогда
			Запись.СтатусКонтрагента = Параметры.СтатусКонтрагента;
		КонецЕсли;
		Если Параметры.Свойство("Автор")
			И ЗначениеЗаполнено(Параметры.Автор) Тогда
			Запись.Автор = Параметры.Автор;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Запись.Партнер) Тогда 
		Запись.Автор = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры
